<script setup lang="ts">

import CHeading from "../../../../components/CHeading.vue";
import CParagraph from "../../../../components/CParagraph.vue";
</script>

<template>
    <c-heading type="MEDIUM">
        Общая информация
    </c-heading>
    <c-paragraph>
        <strong>Важно!</strong> Создание своего шаблона подчиняется
        следующим пунктам. Если у вас вознилки трудности, но напишите
        нам на почту указанную в нижней части сайта.
    </c-paragraph>
    <ul>
        <li>
            Создать новый шаблон можно двумя способами:
            <ul>
                <li>
                    '<b>Загрузить Текущий</b>' - взяв основу шаблон из <i>базовых настроек</i>
                </li>
                <li>
                    '<b>Создать Новый</b>' - без заранее заднных предметов, преподавателей
                    и времени занятий
                </li>
            </ul>
        </li>
        <li>
            Редактируемый шаблон сохраняется <em>автоматически</em>
        </li>
        <li>
            Создание нового шаблона не изменит текущее рассписание, но удалит предыдущий
            редактируемый шаблон
        </li>
        <li>
            '<b>Сделать шаблон текущим рассписанием</b>' - заменит рассписание на ваш шаблон
        </li>
        <li>
            '<b>Поделиться с Сообществом</b>' - загрузит ваш шаблон для общего пользования! заполнив дополнительную
            информацию. После рассмотрения редакцией шаблон будет доступен всем!
        </li>
    </ul>
</template>

<style scoped>

</style>